#!/usr/bin/env python
# encoding: utf-8

"""5. 最长回文子串

给定一个字符串 s，找到 s 中最长的回文子串。你可以假设 s 的最大长度为 1000。

示例 1：

输入: "babad"
输出: "bab"
注意: "aba" 也是一个有效答案。
示例 2：

输入: "cbbd"
输出: "bb"

来源：力扣（LeetCode）
链接：https://leetcode-cn.com/problems/longest-palindromic-substring
著作权归领扣网络所有。商业转载请联系官方授权，非商业转载请注明出处。
"""


class Solution:
    def longestPalindrome(self, s: str) -> str:
        dp = [[False for x in range(len(s))] for y in range(len(s))]
        max_len = 0
        child_str = ""

        for offset in range(len(s)):
            for start in range(len(s)):

                if start + offset >= len(s):
                    continue

                if offset == 0:
                    dp[start][start + offset] = True

                if offset == 1 and s[start] == s[start + offset]:
                    dp[start][start + offset] = True

                if offset >= 2:
                    dp[start][start + offset] = dp[start + 1][start + offset - 1] and s[start] == s[start + offset]

                if dp[start][start + offset]:
                    if max_len < (offset + 1):
                        max_len = offset + 1
                        child_str = s[start:start + offset + 1]

        return child_str


if __name__ == "__main__":
    s = "321012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210012321001232100123210123210012321001232100123210123"
    solution = Solution()
    print(solution.longestPalindrome(s))
